ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_hrcap_regs.xml
<module id="HRCAP_REGS" HW_revision="" description="HRCAP Registers">
	<register id="HRCTL" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="High-Res Control Register ">
		<bitfield id="HRE" description="High Resolution Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HRCLKE" description="High Resolution Clock Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PRDSEL" description="Calibration Period Match " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CALIBSTART" description="Calibration start  " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CALIBSTS" description="Calibration status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CALIBCONT" description="Continuous mode Calibration Select" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="HRINTEN" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="High-Res Calibration Interrupt Enable Register">
		<bitfield id="CALIBDONE" description="Calibration doe interrupt enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CALPRDCHKSTS" description="Calibration period check status enable" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="HRFLG" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="High-Res Calibration Interrupt Flag Register">
		<bitfield id="CALIBINT" description="Global calibration Interrupt Status Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CALIBDONE" description="Calibration Done Interrupt Flag Bit" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CALPRDCHKSTS" description="Calibration period check status Flag Bi" begin="2" end="2" width="1" rwaccess="R"/>
	</register>
	<register id="HRCLR" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="High-Res Calibration Interrupt Clear Register">
		<bitfield id="CALIBINT" description="Clear Global calibration Interrupt Flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CALIBDONE" description="Clear Calibration Done Interrupt Flag Bit " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CALPRDCHKSTS" description="Clear Calibration period check status Flag Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="HRFRC" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="High-Res Calibration Interrupt Force Register">
		<bitfield id="CALIBDONE" description="Force Calibration Done Interrupt Flag Bit " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CALPRDCHKSTS" description="Force Calibration period check status Flag Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="HRCALPRD" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="High-Res Calibration Period Register">
		<bitfield id="PRD" description="Calibration period" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HRSYSCLKCTR" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="High-Res Calibration SYSCLK Counter Register">
		<bitfield id="HRSYSCLKCTR" description="Current SYCLK counter value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HRSYSCLKCAP" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="High-Res Calibration SYSCLK Capture Register">
		<bitfield id="HRSYSCLKCAP" description="Reads captured SYSCLK counter" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HRCLKCTR" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="High-Res Calibration HRCLK Counter Register">
		<bitfield id="HRCLKCTR" description="Current HRCLK counter value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HRCLKCAP" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="High-Res Calibration HRCLK Capture Register">
		<bitfield id="HRCLKCAP" description="Reads captured HRCLK counter" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
